<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of QGIS and creates a package.  The created pkg installs all packages in the downloaded .dmg.

Supports either the latest release or Long Term (support) Release.  Override the key "RELEASE_TYPE" to specify which you need:
Latest Release = "pr"
Long Term (support) Release = "ltr"

Notes:  
- Python 3.6+ is a prerequisite before installing QGIS 3 -- the created .pkg will hard fail if Python 3.6+ is not installed.
- The created .pkg will "uninstall" previous versions of QGIS.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.QGIS</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>QGIS</string>
        <key>RELEASE_TYPE</key>
        <string>pr</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.QGIS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%app_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  uninstall_QGIS.sh
# By:  Zack Thompson / Created:  7/29/2019
# Version:  1.0.0 / Updated:  7/29/2019 / By:  ZT
#
# Description:  This script installs all the packages that are contained in the QGIS dmg.
#
###################################################################################################

echo "*****  Uninstall QGIS Process:  START  *****"

# Check if QGIS is currently installed...
appPaths=$(/usr/bin/find -E /Applications -iregex ".*[/]QGIS\s?([0-9.]*)?[.]app" -type d -maxdepth 1 -prune)

if [[ ! -z "${appPaths}" ]]; then
	echo "QGIS is currently installed; removing this instance before continuing..."

	# If the machine has multiple QGIS Applications, loop through them...
	while IFS="\n" read -r appPath; do
		echo "Deleting:  ${appPath}"
		/bin/rm -rf "${appPath}"
	done &lt; &lt;(echo "${appPaths}")

	echo "QGIS has been removed."
fi

echo "*****  Uninstall QGIS Process:  COMPLETE  *****"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
                    <key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
